#language: ru
Функционал: Ozon

  Предыстория: выполняется открытие страницы

  @success @all @simple
  Сценарий: Заказ на сайте озон
    #шаг №2
    * Зайти в личный кабинет
    #шаг №2.1
    * Нажать на кнопку Вход или регистрация
    #шаг №2.1
    * Нажать войти по почте
    #шаг №2.2
    * Ввести логин "nataly.sun89@mail.ru"
    #шаг №2.2
    * Ввести пароль "5d72uWaW"
    #шаг №2.2
    * Войти
    #шаг №3
    * Ввести название продукта "iPhone 7 Plus/8 Plus Black"
    #шаг №3.1
    * Нажать поиск
    #шаг №3.2
    * Выбрать 5 товаров
    #шаг №4
    * Зайти в корзину
    #шаг №5
    * Сравниваем внесенные товары
    #шаг №6
    * Удаляем содержимое корзины
    #шаг №7
    * Подтверждаем удаление
    #шаг №8
    * Зайти в личный кабинет
    #шаг №9
    * Нажать на кнопку Выйти
    #шаг №10
    * Зайти в личный кабинет
    #шаг №10.0
    * Нажать на кнопку Вход или регистрация
    #шаг №10.1
    * Нажать войти по почте
    #шаг №10.2
    * Ввести логин "nataly.sun89@mail.ru"
    #шаг №10.3
    * Ввести пароль "5d72uWaW"
    #шаг №10.4
    * Войти
    #шаг №11
    * Зайти в корзину
    #шаг №11
    * Проверяем корзину "Корзина пуста"
